Revit 2027 API
PointCloudOverrides.ArePointCloudOverrideSettingsValid Method
 Checks if PointCloudOverrideSettings are valid
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ArePointCloudOverrideSettingsValid(
	string tag,
	PointCloudOverrideSettings settings
)
Public Shared Function ArePointCloudOverrideSettingsValid (
	tag As String,
	settings As PointCloudOverrideSettings
) As Boolean
public:
static bool ArePointCloudOverrideSettingsValid(
	String^ tag,
	PointCloudOverrideSettings^ settings
)
static member ArePointCloudOverrideSettingsValid :
        tag : string *
        settings : PointCloudOverrideSettings -> bool
Parameters
tag String
 The tag identifying the particular scan/region within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getScans/getRegions.
settings PointCloudOverrideSettings
 Override settings to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace